#include <stdio.h>
#include <math.h>

#define FALSE 0
#define TRUE  1

#define lgic int   // ο τύπος lgic χρησιμοποιείται σε μεταβλητές με λογική χρήση

int act (int *err, int *x , int fv, lgic ac) ;

    int par (int *x , int *err) // Η par δέχεται ώς παράμετρους την x και την err (με * ετσι ώστε να ανανεώνονται οι τιμές τους)
    {
        int pfv = 0 ; // parenthesis final variable
        lgic pnmex = FALSE ; // pnmex = parenthesis number exists για να ξέρει το πρόγραμμα αν υπάρχει ή οχι αριθμός (μέσα στην παρένθεση)
        lgic pstep = TRUE ; // λογική μεταβλητή που βοηθάει στον έλεγχο του βήματος της κάθε επανάληψης (TRUE = κάνει βήμα  , FALSE = δεν κάνει βήμα )
        lgic pac = 0 ; // pac = parenthesis action μεταβλητή στην οποία αποθηκεύεται το είδος της πράξης (μέσα στην παρένθεση)
        /**/while  ((*x != ')') && (*x != 10)) { // Βρόχος που επαναλαμβάνεται μέχρι να βρεί το enter ή κλείσιμο παρένθεσης
            /**/if  (((*x <= 90) && (*x >= 65)) || ((*x <= 122) && (*x >= 97))) { // Σε περίπτωση που βρεί γράμμα επιστρέφει error
                *err = 1 ; // err = 1 error για εύρεση γράμματος
                return 0 ;
            }
            else
                /**/if  ((*x < '0') || (*x > '9')) { // Άμα ο χαρακτήρας δεν είναι αριθμός
                    /**/if (*x == '(') { // Άμα ο χαρακτήρας είναι "άνοιγμα παρένθεσης"
                        if ((pnmex) && (pac == 0)) *err = 2 ; // Άμα δεν υπάρχει πράξη ενδιάμεσα στην παρένθεση και στον υπαρκτό αριθμό επιστρέφει error ( "5(5)" :  error)
                        *x = getchar() ; // διαβάζω τον χαρακτήρα μετα απο την παρένθεση
                        pfv = par(x , err) ; // par = parenthesis : function που υπολογίζει την τιμή της παρένθεσης
                        if (*err != 0) return 0 ; // Άμα υπάρχει error τότε τερματίζεται η function
                        pnmex = TRUE ; // pnmex = TRUE γιατι η τιμή της παρένθεσης αποθηκεύτικε στην pfv άρα υπάρχει αριθμός
                    }
                    else if  (*x == '+') { // Άμα x = +
                        pac = 1 ; // Με pac = 1 συμβολίζεται η πρόσθεση
                        pfv = act(err , x, pfv, pac) ; // act = action : function  που επιστρέφει το αποτέλεσμα της πράξης
                        pstep = FALSE ; // pstep = FALSE γιατι όταν τελειώνει η act το x έχει ήδη ανανεωθεί
                        pnmex = TRUE ; // pnmex = TRUE γιατι το αποτέλεσμα της πράξης αποθηκεύτικε στην pfv άρα υπάρχει αριθμός
                    }
                    else if (*x == '-') { // Άμα x = -
                        pac = 2 ; // Με pac = 2 συμβολίζεται η αφαίρεση
                        pfv = act(err , x, pfv, pac) ; // Η act αποθικεύει το αποτέλεσμα της πράξης στην pfv
                        pstep = FALSE ; // pstep = FALSE γιατι όταν τελειώνει η act το x έχει ήδη ανανεωθεί
                        pnmex = TRUE ; // pnmex = TRUE γιατι το αποτέλεσμα της πράξης αποθηκεύτικε στην pfv άρα υπάρχει αριθμός
                    }
                    else if (*x == '*') { // Αμα x = *
                        pac = 3 ; // Με pac = 3 συμβολίζεται το γινόμενο
                        if (!pnmex) *err = 2 ; // Άμα δεν υπάρχει αριθμός τότε δεν θα μπορεί να υπάρξει και γινόμενο
                        pfv = act(err , x, pfv, pac) ; // Η act αποθικεύει το αποτέλεσμα της πράξης στην pfv
                        pstep = FALSE ; // pstep = FALSE γιατι όταν τελειώνει η act το x έχει ήδη ανανεωθεί
                    }
                    else
                        if (*x == ' ') {} // Άμα x = " space " το πρόγραμμα δεν κάνει τίποτα
                    else {
                        *err = 2 ; // Άμα το πρόγραμμα έχει διαβάσει έναν μη αναγνωρίσιμο χαρακτήρα επιστρέφει error
                        return 0 ;
                    }
                    /**/
                }
                else if (!pnmex) { // Άν δεν υπάρχει αριθμός βρίσκει τον αριθμό
                    /**/while ((*x >= '0') && (*x <= '9')){
                    pfv = (10 * pfv) + (*x - '0') ;
                    *x = getchar() ;
                    }
                    pstep = FALSE ; // pstep = FALSE γιατι ανανεώσαμε το x  μέσα στην while
                    pnmex = TRUE ;  // nmex = TRUE γιατί υπάρχει αριθμός
                }
                else *err = 2 ; // Άμα υπάρχει αριθμός και ξαναδιαβάσει αριθμό τότε έχουμε error της μορφής : "12 34"
                /**/
            /**/
            /**/if (pstep) // Άν pstep = TRUE ανανεώνεται το x αλλιώς η μεταβλητή step πέρνει τιμή TRUE (απο FALSE)
                *x = getchar() ;
            else
                pstep = TRUE ;
            /**/
            pac = 0 ; // pac = 0 γιατι σε αυτό το σημείο δεν έχουμε πράξη ή έχει ηδη εκτελεστεί
        /**/}
        if (*x == 10) *err = 4 ; // Άν το x = "enter" τότε έχουμε error της μορφής " (5+3+2\n "
        if (!pnmex) *err = 2 ; // Άμα μετά το κλείσιμο της παρένθεσης το πρόγραμμα δεν έχει βρεί αριθμό τότε έχουμε error της μορφής " ( ) "
        return pfv ; // επιστρέφεται το αποτέλεσμα
    }

    int act (int *err, int *x , int fv, lgic ac) // η act = action : function  πέρνει ώς παραμέτρους  την fv(το αποτέλεσμα) , την ac(πράξη) , το x και την  error
    {
        int temp = 1 ; // temp = temporary προσωρινή μεταβλητή σε περιπτωση που χρειαστει να κρατήσει το πρόγραμμα κάποιον αριθμό (σε γινόμενο) ( "3 + 2 * 1" )
        lgic csign = FALSE ; // csign = change sign λογική μεταβλητή που λέει στο πρόγραμμα πότε χρειαζόμαστε αλλαγή προσήμου
        lgic nac = FALSE ; // nac = new action λογική  μεταβλητή που λέει στο πρόγραμμα ποιά πράξη έχει προτεραιότητα
        lgic sign = 0 ; // Η sign είναι λογική μεταβλητή που λέει στο πρόγραμμα αν ο αριθμός έχει πρόσημο ή όχι και πόσα
        int k = 1 ; // το k είναι μεταβλητή  η οποία χρησιμοποιείται ώς σταθερά για να μην τελειώσει ποτέ η while παρα μόνο όταν έχει βρεθεί το αποτέλεσμα
        /**/while (k) {
            if (!nac) temp = 1 ; // Άμα η nac = FALSE τότε η temp = 1 γιατι το πρόγραμμα δεν έχει βρει κάποιο γινώμενο που να έχει προτεραιότητα και επειδή η temp χρησιμοποιείται στον υπολογισμο του αποτελέσματος
            int sv = 0 ; // sv = second variable είναι η μεταβλητή στην οποία αποθηκεύεται ο δεύτερος αριθμός ( ο αριθμός μετά το σύμβολο της πράξης )
            *x = getchar() ; // ανανεώνεται το x
            /**/if (*x == '*') { // Άν το x = *  τότε έχουμε error της μορφής " -* " , " +* " , "**".
                *err = 2 ;
                *x = getchar() ;
                return 0 ;
            }
            /**/
            /**/if (*x == '-') { // Άν το x = -
                sign++ ;// Άυξάνεται το πλήθος των προσήμων κατα 1
                csign = TRUE ; // csign = TRUE ετσι ώστε το πρόγραμμα να ξέρει οτι χρειαζόμαστε αλλαγή προσήμου ( --  , +- )
                continue ; // Κάνουμε την ίδια διαδηκασία με τον επόμενο χαρακτήρα
            }
            else if (*x == '+') { // Άν το x = +
                    sign++ ; // Άυξάνεται το πλήθος των προσήμων κατα 1
                    continue ; // Κάνουμε την ίδια διαδηκασία με τον επόμενο χαρακτήρα
                }
                /**/
            else if (*x == ' ') continue ; // Άν x = ' ' πάμε στην αρχή της διαδηκασίας
            else if (sign > 1) { // Άν το πλήθος των προσήμων είναι μεγαλύτερο απο το 1 το έχουμε error της μορφής " -(πράξη)+-(πρόσημα)5 "
                    *err = 2 ;
                    return 0 ;
                }
                /**/
            /**/
            /**/if (*x == '(') { // Άμα ο χαρακτήρας είναι "άνοιγμα παρένθεσης"
                *x = getchar() ; // Ανανεώνεται το x
                if (*x == 10) *err = 4 ; // Άν ο επώμενος χαρακτήρας είναι το enter τοτε έχουμε error της μορφής ( "(\n" )
                sv = par(x , err);  // par = parenthesis : function που υπολογίζει την τιμή της παρένθεσης
                if (*err != 0) return 0 ; // Άμα έχουμε  error  τερματίζεται η διαδικασία
                *x = getchar() ; // Άνανεώνεται το x
            }
            else {
                /**/if ((*x < '0') || (*x > '9')) { // Άμα το x δεν είναι αριθμός τότε έχουμε error της μορφής " -^#&@  ή +^@#$ "
                    *err = 3 ;
                    return 0 ;
                }
                /**/
                /**/while ( (*x >= '0') && (*x <= '9') ) { // Το πρόγραμμα βρίσκει το δεύτερο αριθμό
                    sv = (10 * sv)+ *x-'0' ;
                    *x = getchar() ;
                }
                /**/
                /**/if (*x == ' ') { // Άν το x  = ' '
                    while ((*x = getchar()) == ' ') ; // Άνανεώνεται το x μέχρι να γίνει διάφορο του ' '
                    /**/if ((*x >= '0') && (*x <= '9')) { // Άν το x είναι αριθμός έχουμε error της μορφής "12 34"
                        *err = 2 ;
                        return 0 ;
                    }
                    /**/
                }
                /**/
            }
            /**/
            /**/if (csign) { // Άν έχουμε αλλαγή προσήμου
                csign = FALSE ; // csign = FALSE γιατι δεν έχουμε πια αλλαγή προσήμου
                sv = -sv ; // Πραγματοποιείται αλλαγή προσήμου
            }
            /**/
            /**/if (*x == '*') { // Άν το x = *
                nac = TRUE ; // nac = TRUE γιατι έχουμε καινούρια πράξη το γινόμενο
                temp *= sv ; // αποθηκεύουμε την τιμή της sv στην temp
                sign = 0 ; // Μηδενίζεται το πλήθος των προσήμων
                continue ; // Προχωρά το πρόγραμμα στην εύρεση του επόμενου χαρακτήρα
            }
            else
                nac = FALSE ; // nac = FALSE γιατι δεν έχουμε καινούρια πράξη
            /**/
            /**/if (ac == 1)  // Ανάλογα με την τιμή της ac το πρόγραμμα εκτελεί και την αντίστοιχη πράξη.
                fv += temp*sv ;
            else if ( ac == 2)
                fv -= temp*sv ;
            else if ( ac == 3)
                fv *= temp*sv ;
            /**/
            return fv ; // Η act επιστρέφει το αποτέλεσμα της πράξης
        }
        /**/
    }


    int sol (int *x , int *err) // Η sol δέχεται ώς παράμετρους την x και την err (με * ετσι ώστε να ανανεώνονται οι τιμές τους)
    {
        int fv = 0 ; // final variable
        lgic nmex = FALSE ; // nmex = number exists για να ξέρει το πρόγραμμα αν υπάρχει ή οχι αριθμός
        lgic step = TRUE ; // λογική μεταβλητή που βοηθάει στον έλεγχο του βήματος της κάθε επανάληψης (TRUE = κάνει βήμα  , FALSE = δεν κάνει βήμα )
        lgic ac = 0 ; // ac = action μεταβλητή στην οποία αποθηκεύεται το είδος της πράξης
        /**/while  (*x != 10)  { // Βρόχος που επαναλαμβάνεται μέχρι να βρεί το enter
            /**/if  (((*x <= 90) && (*x >= 65)) || ((*x <= 122) && (*x >= 97))) { // Σε περίπτωση που βρεί γράμμα επιστρέφει error
                *err = 1 ; // err = 1 error για εύρεση γράμματος
                return 0 ;
            }
            else
                /**/if  ((*x < '0') || (*x > '9')) { // Άμα ο χαρακτήρας δεν είναι αριθμός
                    /**/if (*x == '(') { // Άμα ο χαρακτήρας είναι "άνοιγμα παρένθεσης"
                        if ((nmex) && (ac == 0)) *err = 2 ; // Άμα δεν υπάρχει πράξη ενδιάμεσα στην παρένθεση και στον υπαρκτό αριθμό επιστρέφει error ( "5(5)" :  error)
                        *x = getchar() ; // διαβάζω τον χαρακτήρα μετα απο την παρένθεση
                        fv = par(x , err) ; // par = parenthesis : function που υπολογίζει την τιμή της παρένθεσης
                        if (*err != 0) return 0 ; // Άμα υπάρχει error τότε τερματίζεται η function
                        nmex = TRUE ; // nmex = TRUE γιατι η τιμή της παρένθεσης αποθηκεύτικε στην fv άρα υπάρχει αριθμός
                    }
                    else if  (*x == '+') { // Άμα x = +
                        ac = 1 ; // Με ac = 1 συμβολίζεται η πρόσθεση
                        fv = act(err , x, fv, ac) ; // act = action : function  που επιστρέφει το αποτέλεσμα της πράξης
                        step = FALSE ; // step = FALSE γιατι όταν τελειώνει η act το x έχει ήδη ανανεωθεί
                        nmex = TRUE ; // nmex = TRUE γιατι το αποτέλεσμα της πράξης αποθηκεύτικε στην fv άρα υπάρχει αριθμός
                    }
                    else if (*x == '-') { // Άμα x = -
                        ac = 2 ; // Με ac = 2 συμβολίζεται η αφαίρεση
                        fv = act(err , x, fv, ac) ; // Η act αποθικεύει το αποτέλεσμα της πράξης στην fv
                        step = FALSE ; // step = FALSE γιατι όταν τελειώνει η act το x έχει ήδη ανανεωθεί
                        nmex = TRUE ; // nmex = TRUE γιατι το αποτέλεσμα της πράξης αποθηκεύτικε στην fv άρα υπάρχει αριθμός
                    }
                    else if (*x == '*') { // Αμα x = *
                        ac = 3 ; // Με ac = 3 συμβολίζεται το γινόμενο
                        if (!nmex) *err = 2 ; // Άμα δεν υπάρχει αριθμός τότε δεν θα μπορεί να υπάρξει και γινόμενο
                        fv = act(err , x, fv, ac) ; // Η act αποθικεύει το αποτέλεσμα της πράξης στην fv
                        step = FALSE ;  // step = FALSE γιατι όταν τελειώνει η act το x έχει ήδη ανανεωθεί
                    }
                    else
                        if (*x == ' ') {} // Άμα x = " space " το πρόγραμμα δεν κάνει τίποτα
                    else {
                        *err = 2 ; // Άμα το πρόγραμμα έχει διαβάσει έναν μη αναγνωρίσιμο χαρακτήρα επιστρέφει error
                        return 0 ;
                    }
                    /**/
                }
                else if (!nmex) { // Άν δεν υπάρχει αριθμός βρίσκει τον αριθμό
                    /**/while ((*x >= '0') && (*x <= '9')) {
                    fv = (10 * fv) + (*x - '0') ;
                    *x = getchar() ;
                    /**/}
                    step = FALSE ; // step = FALSE γιατι ανανεώσαμε το x  μέσα στην while
                    nmex = TRUE ; // nmex = TRUE γιατί υπάρχει αριθμός
                }
                else *err = 2 ; // Άμα υπάρχει αριθμός και ξαναδιαβάσει αριθμό τότε έχουμε error της μορφής : "12 34"
                /**/
            /**/
            /**/if (step)  // Άν step = TRUE ανανεώνεται το x αλλιώς η μεταβλητή step πέρνει τιμή TRUE (απο FALSE)
                *x = getchar()  ;
            else
                step = TRUE ;
            /**/
            ac = 0 ; // ac = 0 γιατι σε αυτό το σημείο δεν έχουμε πράξη ή έχει ηδη εκτελεστεί
        }
        /**/
        return fv ; // επιστρέφεται το αποτέλεσμα
    }

    void error (int err , int i)
    {
        /**/if (err == 1)
            printf("Result %d: Error!",i) ;
        else if (err == 2)
            printf("Result %d: Unexpected character",i) ;
        else if (err == 3)
            printf("Result %d: Unexpected end of input",i) ;
        else if (err == 4)
            printf("Result %d: Missing closing parenthesis",i);
        /**/
    }

int main ()
{
    printf("give char:\n") ;
    int i = 0 ; // Αριθμεί τα αποτελέσματα
    int x ; // Αποθηκεύονται ένας ένας οι χαρακτήρες κατα την ανάγνωσή τους
    /**/while ( (x = getchar()) != EOF ) { // Αυτός ο βρόχος επαναλαμβάνεται μέχρι ο χρήστης να τερματίσει το πρόγραμμα
        int err = 0 ; // μεταβλητή error ( 0 = κανένα πρόβλημα )
        i++;
        double fv = sol(&x , &err) ;  // fv = final variable είναι η μεταβλητή που κουβαλάει το τελικό αποτέλεσμα , sol = solution function που βρίσκει την λύση
        /**/if ( err != 0 ) { // Άμα έχουμε error..
            error(err , i) ; // function που εμφανίζει το κατάλληλο μήνυμα για κάθε διαφορετικό είδος λάθους
            if (x != 10) while ((x = getchar()) != 10) ; // διαβάζει χαρακτήρες μέχρι να βρεί enter έτσι ώστε να προχωρήσει στις επόμενες πράξεις (σε περίπτωση λάθους το πρόγραμμα σταματάει να υπολογίζει)
        }
        else // Άμα δεν έχουμε error
            printf("Result %d: %d" ,i,(int)fv) ; // Εμφανιζεται το αποτέλεσμα
        /**/
        printf("\n") ; // αλλαγή γραμμής για να είναι όλα ποιό ξεκάθαρα
    }
    /**/
    return 0 ;
}
